# 2. DataFrame
2차원 데이터 (Series 들의 모음)

## Data 준비
사전 (dict) 자료구조를 통해서 생성 
예) 슬램덩크 주요 인물 8명에 대한 데이터

In [10]:
data = {
    '이름':['채치수','정대만','송태섭','서태웅','강백호','변덕규','황태산','윤대협'],
    '학교':['북산고','북산고','북산고','북산고','북산고','능남고','능남고','능남고'],
    '키': [197,184,168,187,188,202,188,190],
    '국어': [90, 40, 80, 40, 15, 80, 55, 100],
    '영어': [85, 35, 75, 60, 20, 100, 65, 85],
    'SW': ['Python', 'Java', 'JS', '','','C', 'PYTHON', 'C#']
}
data

{'이름': ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
 '학교': ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
 '키': [197, 184, 168, 187, 188, 202, 188, 190],
 '국어': [90, 40, 80, 40, 15, 80, 55, 100],
 '영어': [85, 35, 75, 60, 20, 100, 65, 85],
 'SW': ['Python', 'Java', 'JS', '', '', 'C', 'PYTHON', 'C#']}

In [11]:
data['이름']

['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협']

In [12]:
data['키']

[197, 184, 168, 187, 188, 202, 188, 190]

## DataFrame 객체 생성

In [13]:
import pandas as pd
df = pd.DataFrame(data)

In [14]:
df

    이름   학교    키   국어   영어      SW
0  채치수  북산고  197   90   85  Python
1  정대만  북산고  184   40   35    Java
2  송태섭  북산고  168   80   75      JS
3  서태웅  북산고  187   40   60
4  강백호  북산고  188   15   20
5  변덕규  능남고  202   80  100       C
6  황태산  능남고  188   55   65  PYTHON
7  윤대협  능남고  190  100   85      C#

## 데이터 접근

In [15]:
df['이름'] #column value

0    채치수
1    정대만
2    송태섭
3    서태웅
4    강백호
5    변덕규
6    황태산
7    윤대협
Name: 이름, dtype: object

In [17]:
df[['이름', '키']]  #원하는 column 의 key 만 list 로 변환해서 전달

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168
3  서태웅  187
4  강백호  188
5  변덕규  202
6  황태산  188
7  윤대협  190

## DataFrame 객체 생성 (Index 지정)

In [20]:
df = pd.DataFrame(data, index=['1번','2번','3번','4번','5번','6번','7번','8번']) #리스트 갯수는 일치되어야 함
df

     이름   학교    키   국어   영어      SW
1번  채치수  북산고  197   90   85  Python
2번  정대만  북산고  184   40   35    Java
3번  송태섭  북산고  168   80   75      JS
4번  서태웅  북산고  187   40   60
5번  강백호  북산고  188   15   20
6번  변덕규  능남고  202   80  100       C
7번  황태산  능남고  188   55   65  PYTHON
8번  윤대협  능남고  190  100   85      C#

## DataFrame 객체 생성 (Column 지정)
data 중에서 원하는 column 만 선택하거나, 순서 변경 가능

In [23]:
df = pd.DataFrame(data, columns=['이름', '학교', '키']) #리스트의 순서를 변경해서 원하는 대로 가능
df

    이름   학교    키
0  채치수  북산고  197
1  정대만  북산고  184
2  송태섭  북산고  168
3  서태웅  북산고  187
4  강백호  북산고  188
5  변덕규  능남고  202
6  황태산  능남고  188
7  윤대협  능남고  190